# User
# Напишіть програму, яка обчислить номінальну заробітну плату користувача
# відповідно до кількості робочих годин і ставки на годину.
# Сплачуйте стандартну ставку за 40 робочих годин та 1.5-кратну ставку на годину
# за години, які він відпрацював понад 40 годин.
# Для тестування використовуйте 45 годин та ставку 10.50 за годину
# (оплата має бути 498.75).
# Ви маєте застосувати input для читання рядка і float() для перетворення рядка на число.
# Не зважайте на можливі помилки при введенні даних – вважаємо, що користувач правильно вводить дані.

hrs = input("Enter Hours:")  # Введіть кількість робочих годин
h = float(hrs)

rate_per_hour = float(input("Enter Rate per Hour:"))  # Введіть ставку на годину

# Обчислення заробітної плати
if h <= 40:
    # Якщо робочий час не перевищує 40 годин, то просто обчислюємо стандартну зарплату
    pay = h * rate_per_hour
else:
    # Якщо робочий час перевищує 40 годин, то обчислюємо стандартну зарплату за перші 40 годин
    # і додаємо 1.5-кратну ставку за годину за кожну годину, яку користувач відпрацював понад 40 годин
    pay = 40 * rate_per_hour + (h - 40) * 1.5 * rate_per_hour

# Виведення результату
print("Pay:", pay)
